[
    {
        "title": "Kung Pao Chicken",
        "ingredients": [
                        "2 tablespoons cornstarch, dissolved in 2 tablespoons water",
                        "2 tablespoons white wine, divided",
                        "2 tablespoons soy sauce, divided",
                        "2 tablespoons sesame oil, divided",
                        "1 pound skinless, boneless chicken breast halves - cut into chunks",
                        "1 ounce hot chili paste",
                        "2 teaspoons brown sugar",
                        "1 teaspoon distilled white vinegar",
                        "1 (8 ounce) can water chestnuts",
                        "4 ounces chopped peanuts",
                        "4 green onions, chopped",
                        "1 tablespoon chopped garlic"
                        ],
        "readyInMinutes": 90,
        "summary": "This tasty kung pao chicken is similar to what is served in Chinese restaurants. It's easy to make, and you can be as creative with the measurements as you want. You can't go wrong! The sauce reduces until nice and thick.",
        "instructions": [
                        "Gather all ingredients.",
                        "Combine water and cornstarch in a cup; set aside.",
                        "Combine 1 tablespoon wine, 1 tablespoon soy sauce, 1 tablespoon sesame oil, and 1 tablespoon cornstarch/water mixture in a large glass bowl. Add chicken pieces and toss to coat. Cover the dish and refrigerate for about 30 minutes.",
                        "Combine remaining 1 tablespoon wine, 1 tablespoon soy sauce, 1 tablespoon sesame oil, and remaining cornstarch/water mixture in a medium bowl. Whisk in chili paste, brown sugar, and vinegar. Add water chestnuts, peanuts, green onions, and garlic and toss to coat.",
                        "Transfer water chestnut mixture to a medium skillet. Heat slowly over medium heat until aromatic.",
                        "Meanwhile, transfer chicken from marinade into a large skillet; cook over medium-high heat, stirring, until chicken is cooked through and juices run clear.",
                        "Combine water chestnut mixture and sautéed chicken together in one skillet. Adjust heat and simmer together until sauce thickens."
                        ],
        "imageUrl": "kungpaochicken.jpg"
    },
    {
        "title": "One Pot Chicken Pomodoro",
        "ingredients": [
                        "1 pound thinly sliced skinless, boneless chicken breasts",
                        "1 1/2 teaspoon salt",
                        "1 teaspoon garlic granules",
                        "1 teaspoon Italian seasoning",
                        "2 tablespoons olive oil, divided",
                        "1 shallot, minced",
                        "4 cloves garlic, minced",
                        "1 (28 ounce) can can crushed tomatoes",
                        "1 teaspoon white sugar",
                        "1/2 teaspoon crushed red pepper flakes",
                        "1 tablespoon chopped fresh basil",
                        "1 3/4 cups chicken broth",
                        "1/4 cup pinot grigio",
                        "16 ounces conchiglie pasta"
                        ],
        "readyInMinutes": 30,
        "summary": "This one pot chicken pomodoro has a bright fresh flavor and is a fabulous weeknight meal. Pair with a salad to round out dinner.",
        "instructions": [
                        "Gather all ingredients. Heat a deep cast iron skillet over medium heat.",
                        "Season chicken breasts with salt, garlic, and Italian seasoning.",
                        "Pour 2 teaspoons oil into the skillet. Once hot, add chicken. Cook until golden, turning once, about 4 minutes per side. Move chicken to one side of the skillet.",
                        "Pour remaining oil into the skillet. Add minced shallot; cook until softened, about 3 minutes. Add the garlic, stir until fragrant, about 1 minute.",
                        "Add the crushed tomatoes, salt, sugar, red pepper flakes, and basil. Pour in chicken broth and wine. Stir to combine.",
                        "Add pasta to the skillet. Nestle chicken pieces on top of pasta. Reduce heat to medium-low. Cover, and cook until pasta is tender with a bite, about 8 minutes. Taste and adjust seasoning; serve immediately."
                        ],
        "imageUrl": "chickenpomodoro.jpg"
    },
    {
        "title": "Chicken & Egg Donburi",
        "ingredients": [
                        "1 cup Japanese rice",
                        "1/3 cup chicken stock",
                        "1 tsp white sugar",
                        "1 tbsp soy sauce",
                        "2 tbsp vegetable oil",
                        "1/2 onion, sliced",
                        "200g (7 oz) chicken thighs, thinly sliced",
                        "3 eggs, lightly whisked",
                        "1/4 cup finely sliced spring onion (scallions)",
                        "shichimi togarashi or chilli flakes to serve (optional)"
                        ],
        "readyInMinutes": 25,
        "summary": "Comforting, satisfying and full of savoury goodness.",
        "instructions": [
                        "Cook rice according to packet instructions.  Keep warm and just before serving, divide rice among 2 serving bowls",
                        "In a small bowl, combine the chicken stock, sugar and soy sauce.",
                        "In a small frying pan, heat half of the vegetable oil over medium-high heat.  Add half the onions and stir-fry for 2 minutes.  Add half the chicken and stir-fry for 3-4 minutes or until just cooked.  Pour half of the chicken stock mixture into the pan and simmer for about a minute.  Drizzle half the eggs over the contents of the pan.  Cook for about 2 minutes or until the egg is just set.",
                        "Remove pan from heat and slide the contents onto a bowl of rice.  Repeat with the remaining ingredients. Sprinkle with spring onion and shichimi togarashi."
                        ],
        "imageUrl": "chickeneggdonburi.jpg"
    },
    {
        "title": "Japchae",
        "ingredients": [
                        "4 ounces beef, filet mignon (or pork shoulder), cut into 1/4 inch wide and 2 1/2 inch long strips",
                        "2 large dried shiitake mushrooms, soaked in warm water for 2 to 3 hours, cut into thin strips",
                        "2 garlic cloves, minced",
                        "1 tablespoons plus 2 teaspoons sugar",
                        "2 tablespoons plus 1 teaspoon soy sauce",
                        "2 tablespoons toasted sesame oil",
                        "1 tablespoon toasted sesame seeds",
                        "1 large egg",
                        "4 ounces spinach, washed and drained",
                        "4 ounces of dangmyeon (sweet potato starch noodles)",
                        "2 to 3 green onions, cut crosswise into 2 inch long pieces",
                        "1 medium onion (1 cup), sliced thinly",
                        "4 to 5 white mushrooms, sliced thinly",
                        "1 medium carrot (3/4 cup), cut into matchsticks",
                        "1/2 red bell pepper, cut into thin strips (optional)",
                        "ground black pepper",
                        "kosher salt",
                        "vegetable oil"
                        ],
        "readyInMinutes": 60,
        "summary": "Sweet potato starch noodles stir fried with vegetables",
        "instructions": [
                        "Put the beef and shiitake mushrooms into a bowl and mix with 1 clove of minced garlic, 1 teaspoon sugar, ¼ teaspoon ground black pepper, 2 teaspoons soy sauce, and 1 teaspoon of toasted sesame oil with a wooden spoon or by hand. Cover and keep it in the fridge.",
                        "Crack the egg and separate the egg yolk from the egg white. Remove the white stringy stuff (chalaza) from the yolk. Beat in a pinch of salt with a fork.",
                        "Add 1 teaspoon of vegetable oil to a heated nonstick pan. Swirl the oil around so it covers the pan, and then wipe off the excess heated oil with a kitchen towel so only a thin layer remains on the pan.",
                        "To keep the jidan as yellow as possible, turn off the heat and pour the egg yolk mixture into the pan. Tilt it around so the mixture spreads thinly. Let it cook using the remaining heat in the pan for about 1 minute. Flip it over and let it sit on the pan for 1 more minute.",
                        "Let it cool and slice it into thin strips.",
                        "Bring a large pot of water to a boil. Add the spinach and blanch for 30 seconds to 1 minute, then take it out with a slotted spoon or strainer. Let the water keep boiling to cook the noodles.",
                        "Rinse the spinach in cold water to stop it from cooking. Squeeze it with your hands to remove any excess water. Cut it a few times and put it into a bowl. Mix with 1 teaspoon soy sauce and 1 teaspoon toasted sesame oil. Put it into a large mixing bowl.",
                        "Put the noodles into the boiling water, cover and cook for 1 minute. Stir them with a wooden spoon so they don’t stick together. Cover and keep cooking for another 7 minutes until the noodles are soft and chewy.",
                        "Strain and cut them a few times with kitchen scissors. Put the noodles into the large bowl next to the spinach. Add 2 teaspoons toasted sesame oil, 1 teaspoon soy sauce, and 1 teaspoon sugar. Mix well by hand or a wooden spoon. This process will season the noodles and also keep the noodles from sticking to each other.",
                        "Heat up a skillet over medium high heat. Add 2 teaspoons vegetable oil with the onion, the green onion, and a pinch of salt. Stir-fry about 2 minutes until the onion looks a little translucent. Transfer to the noodle bowl.",
                        "Heat up the skillet again and add 2 teaspoons vegetable oil. Add the white mushrooms and a pinch of salt. Stir-fry for 2 minutes until softened and a little juicy. Transfer to the noodle bowl.",
                        "Heat up the skillet and add 1 teaspoon vegetable oil. Add the carrot and stir-fry for 20 seconds. Add the red bell pepper strips and stir-fry another 20 seconds. Transfer to the noodle bowl.",
                        "Heat up the skillet and add 2 teaspoons vegetable oil. Add the beef and mushroom mixture and stir fry for a few minutes until the beef is no longer pink and the mushrooms are softened and shiny. Transfer to the noodle bowl.",
                        "Add 1 minced garlic clove, 1 tablespoon soy sauce, 1 tablespoon sugar, ½ teaspoon ground black pepper, and 2 teaspoons of toasted sesame oil to the mixing bowl full of ingredients. Mix all together by hand.",
                        "Add the egg garnish and 1 tablespoon sesame seeds. Mix it and transfer it to a large plate and serve."
                        ],
        "imageUrl": "japchae.jpg"
    },
    {
        "title": "Slow Cooker Butter Chicken",
        "ingredients": [
                        "2 tablespoons butter",
                        "2 tablespoons vegetable oil",
                        "4 large skinless, boneless chicken thighs, cut into bite-sized pieces",
                        "1 onion, diced",
                        "3 cloves garlic, minced",
                        "1 (6 ounce) can tomato paste",
                        "1 tablespoon curry paste",
                        "2 teaspoons curry powder",
                        "2 teaspoons tandoori masala",
                        "1 teaspoon garam masala",
                        "15 green cardamom pods",
                        "1 (14 ounce) can coconut milk",
                        "1 cup low-fat plain yogurt",
                        "salt to taste"
                        ],
        "readyInMinutes": 270,
        "summary": "It's easy to prep this butter chicken in the slow cooker in the morning to come home to the wonderful aroma of warm Indian spices. Serve with basmati rice and warm naan bread.",
        "instructions": [
                        "Gather all ingredients.",
                        "Heat butter and vegetable oil in a large skillet over medium heat. Stir in chicken, onion, and garlic. Cook and stir until onion has softened and turned translucent, about 10 minutes.",
                        "Stir in tomato paste, curry paste, curry powder, tandoori masala, and garam masala until no lumps of tomato paste remain.",
                        "Pour mixture into a slow cooker; stir in cardamom pods, coconut milk, and yogurt. Season with salt.",
                        "Cook on High for 4 to 6 hours or Low for 6 to 8 hours, or until chicken is tender and sauce has reduced to the desired consistency. Remove and discard cardamom pods before serving."
                        ],
        "imageUrl": "butterchicken.jpg"
    },
    {
        "title": "Pork Belly with 40 Cloves of Garlic",
        "ingredients": [
                        "1 1/4 pounds skin-on pork belly",
                        "2 cups low sodium chicken stock",
                        "2 1/2 teaspoon soy sauce",
                        "2 teaspoons oyster sauce",
                        "1/2 teaspoon sesame oil",
                        "1/4 teaspoon white pepper",
                        "40 cloves garlic",
                        "2 tablespoons neutral oil",
                        "2 slices ginger",
                        "1 star anise",
                        "1/4 cup Shaoxing wine",
                        "1/2 teaspoon sugar",
                        "1 tablespoon finely chopped shallot",
                        "1 scallion"
                        ],
        "readyInMinutes": 60,
        "summary": "This recipe for braised pork belly with 40 cloves of garlic is a Chinese-inspired riff on the classic French dish—and just as delicious!",
        "instructions": [
                        "Bring a pot of water to a boil. Blanch the pork belly pieces for 2 minutes. Drain, rinse the pork belly pieces, and set aside.",
                        "In a large measuring cup or medium bowl, combine the chicken stock, soy sauce, oyster sauce, sesame oil, and white pepper.",
                        "To peel the garlic, grab a relatively large but lightweight metal pot with a lid. Place all of the individual garlic cloves (they should be separated) into the pot, and close the lid. Holding the pot tightly closed, vigorously shake the garlic in the pot for 30 seconds. This will shake the garlic skins loose and make peeling much easier. You can also do this in a closed mason jar. Just shake the garlic in 3 smaller batches. Another method is to pour boiling water over the top of the garlic in a heatproof bowl. After 1 minute, the skins should come right off.",
                        "Heat a wok or deep pot over medium-low heat. Add the neutral oil, ginger slices, star anise, and all of the peeled garlic cloves. Cook, stirring often, until the garlic is lightly browned.",
                        "At this point, you can remove half or all of the garlic cloves with a slotted spoon and set them aside. Leaving the garlic in the pot creates a deeper garlic flavor in the dish. Removing them now and adding them back later gives you whole garlic cloves to enjoy with the chunks of pork belly. Removing half gives you the best of both worlds, half of the garlic cooked down into the sauce and the other half in whole soft tender cloves.",
                        "Next, add the pork belly and fry in the garlic infused oil for 6-7 minutes, or until lightly browned. Stir in the wine and 1/2 teaspoon of sugar.",
                        "Add the chicken stock mixture to the pot, along with the shallot. Bring the mixture to a simmer, cover, and continue to cook for another 15 minutes, stirring occasionally.",
                        "If you decided to remove any garlic after you infused the oil, now is the time to add them back. Continue to cook for another 15 minutes, covered, stirring occasionally. The liquid should gradually reduce, but should never dry out during the 30 minutes of cooking.",
                        "After 30 minutes, uncover and continue to cook for about 5 minutes, or until the sauce has thickened and coats the pork belly. If needed, turn up the heat to reduce the sauce. Garnish with the chopped scallion, and serve."
                        ],
        "imageUrl": "porkbelly.jpg"
    }
]
